app/views/gossips/show.html.erb

        <div class="card-header">
        <%= link_to "Auteur: " + @gossip.user.first_name + " " + @gossip.user.last_name , profile_path(:id => @gossip.user.id)%></p>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 41], ["LIMIT", 1]]

          <%end%>
          <p class="card-text">Likes: <%=  @gossip.likes.count %></p>
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."gossip_id" = $1  [["gossip_id", 109]]

  <!-- List gossip -->
<h3 class="mt-4 mb-4">Commentaires: <%=  @gossip.comments.count%></h3>
<% @gossip.comments.each do |comment|%>
---
SELECT "comments".* FROM "comments" WHERE "comments"."gossip_id" = $1  [["gossip_id", 109]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."gossip_id" = $1  [["gossip_id", 110]]
SELECT "comments".* FROM "comments" WHERE "comments"."gossip_id" = $1  [["gossip_id", 110]]

          <div class="ml-auto d-flex">
            Auteur: <%=comment.user.first_name%><br>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 60], ["LIMIT", 1]]