app/views/welcome/show.html.erb

SELECT "gossips".* FROM "gossips"
---

      <% Gossip.all.each do |gossip|%>

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
---
                  <a class="h5"
                    href="<%= profile_path(:id => gossip.user.id)%>"><b><%= gossip.user.first_name %></b></a><br>

SELECT COUNT(*) FROM "comments" WHERE "comments"."gossip_id" = $1  [["gossip_id", 95]]
---
            <div class="card-body ">
            <p style="margin-top:-1px;position:absolute"><%= gossip.comments.count %> Commentaires</p>

SELECT COUNT(*) FROM "likes" WHERE "likes"."gossip_id" = $1  [["gossip_id", 109]]
---

            <p><%= gossip.likes.count %> Likes </p>