app/controllers/comments_controller.rb

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 95], ["LIMIT", 1]]
---
  def destroy
    @gossip = Gossip.find(params[:gossip_id])