app/controllers/comments_controller.rb

  def create
    @comment = Comment.new
    @gossip = Gossip.find(params[:gossip_id])
    @comment = Comment.create(content: params[:content], user: User.last, gossip: @gossip)
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 98], ["LIMIT", 1]]
INSERT INTO "comments" ("content", "user_id", "gossip_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "azsd"], ["user_id", 50], ["gossip_id", 95], ["created_at", "2020-08-05 21:46:46.418116"], ["updated_at", "2020-08-05 21:46:46.418116"]]
SELECT  "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT $1  [["LIMIT", 1]]

  def update
    @comment = Comment.find(params[:id])
    @comment.update(content: params[:content], user: User.last, gossip: Gossip.find(params[:gossip_id]))
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 95], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 44], ["LIMIT", 1]]
UPDATE "comments" SET "content" = $1, "user_id" = $2, "updated_at" = $3 WHERE "comments"."id" = $4  [["content", "testing"], ["user_id", 44], ["updated_at", "2020-08-06 07:23:44.659330"], ["id", 3]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def update2
    @gossip = Gossip.find(params[:id])
    @comment = Comment.find(params[:id])
    comment_params = params.require(:comment).permit(:content)

    @comment = @gossip.comments.create(params[:comment].permit(:content))

    if @comment.update(comment_params)
      flash[:success] = "The gossip was succesfully updated !"
      redirect_to gossip_path(@gossip.id)
    else
      @alert = true
      @message = "Error: " + @gossip.errors.messages.to_a.flatten[1]
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 109], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 95], ["LIMIT", 1]]