app/controllers/gossips_controller.rb

  def create
    id = User.all.sample.id
---
SELECT "users".* FROM "users"