app/controllers/gossips_controller.rb

INSERT INTO "gossips" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "test2"], ["content", "currently testing\r\n"], ["user_id", 61], ["created_at", "2020-08-06 15:34:44.647924"], ["updated_at", "2020-08-06 15:34:44.647924"]]
---
  def create
    @gossip = Gossip.new(title: params[:title], content:params[:content], user_id: current_user.id)

    if @gossip.save

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 93], ["LIMIT", 1]]
UPDATE "gossips" SET "title" = $1, "updated_at" = $2 WHERE "gossips"."id" = $3  [["title", "3test"], ["updated_at", "2020-08-05 14:21:11.579170"], ["id", 93]]
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
  def update
    @gossip = Gossip.find(params[:id])
    gossip_params = params.require(:gossip).permit(:title, :content)

    if @gossip.update(gossip_params)
      flash[:success] = "The gossip was succesfully updated !"
      redirect_to gossip_path(@gossip.id)
    else
      @alert = true
      @message = "Error: " + @gossip.errors.messages.to_a.flatten[1]