app/controllers/profile_controller.rb

  def show
    @user = User.find_by(:first_name => params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."first_name" = $1 LIMIT $2  [["first_name", "Lakendra"], ["LIMIT", 1]]