app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    @user.city_id = City.all.sample.id
    if @user.save
---
SELECT "cities".* FROM "cities"
INSERT INTO "users" ("first_name", "last_name", "description", "email", "age", "city_id", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"