app/views/cities/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."city_id" = $1  [["city_id", 48]]
SELECT "gossips".* FROM "gossips" WHERE "gossips"."user_id" = $1  [["user_id", 41]]
---
<h3 class="mt-4 mb-4">Les potins de <%= @city.name %>:</h3>
<% @city.users.each do |user|%>
<% user.gossips.each do |gossip|%>